### Hoje

* Ver pandas
* Fazer gráficos no pandas
* Falar do projeto.

In [3]:
import pandas as pd 
dictionary = {'Alunos': ['Sandro', 'Rafael', 'Tiago', 'André', 'Camila', 'Teo', 'Carlos', 'Juca', 'Carla'],'Notas': [8, 10, 9.5, 7.5, 9.5, 10, 5, 6.5, 10]}

ds = pd.Series(dictionary)

# Data Frame
df = pd.DataFrame(dictionary)
df

   Alunos  Notas
0  Sandro    8.0
1  Rafael   10.0
2   Tiago    9.5
3   André    7.5
4  Camila    9.5
5     Teo   10.0
6  Carlos    5.0
7    Juca    6.5
8   Carla   10.0

In [6]:
df['Alunos']

0    Sandro
1    Rafael
2     Tiago
3     André
4    Camila
5       Teo
6    Carlos
7      Juca
8     Carla
Name: Alunos, dtype: object

In [9]:
df.tail()

   Alunos  Notas
4  Camila    9.5
5     Teo   10.0
6  Carlos    5.0
7    Juca    6.5
8   Carla   10.0

In [8]:
df.head()

   Alunos  Notas
0  Sandro    8.0
1  Rafael   10.0
2   Tiago    9.5
3   André    7.5
4  Camila    9.5

In [11]:
df['Notas']

0     8.0
1    10.0
2     9.5
3     7.5
4     9.5
5    10.0
6     5.0
7     6.5
8    10.0
Name: Notas, dtype: float64

In [15]:
# Filtrar e ver apenas a nota da camila

df[df['Alunos'] == 'Camila']

   Alunos  Notas
4  Camila    9.5

In [16]:
mascara = df['Alunos'] == 'Camila'

df[mascara]

   Alunos  Notas
4  Camila    9.5

In [18]:
# alunos notas entre 5 e 8

df[(df['Notas'] > 5) & (df['Notas'] < 8) ]

  Alunos  Notas
3  André    7.5
7   Juca    6.5

In [19]:
condicao1 = df['Notas'] > 5
condicao2 = df['Notas'] < 8

df[condicao1 & condicao2]

  Alunos  Notas
3  André    7.5
7   Juca    6.5

In [20]:
df[ df['Notas'] == df['Notas'].max() ]

   Alunos  Notas
1  Rafael   10.0
5     Teo   10.0
8   Carla   10.0

In [22]:
lista_notas = [8., 10., 5.]
lista_notas

df[ df['Notas'].isin(lista_notas)]

   Alunos  Notas
0  Sandro    8.0
1  Rafael   10.0
5     Teo   10.0
6  Carlos    5.0
8   Carla   10.0

In [24]:
# Apenas nomes que comaçam com a letra A

df[ df['Alunos'].str.startswith('A')]

  Alunos  Notas
3  André    7.5

In [25]:
df[ df['Alunos'].str.lower().str.startswith('a')]

  Alunos  Notas
3  André    7.5

In [26]:
# Melhorando DataFrame

df

   Alunos  Notas
0  Sandro    8.0
1  Rafael   10.0
2   Tiago    9.5
3   André    7.5
4  Camila    9.5
5     Teo   10.0
6  Carlos    5.0
7    Juca    6.5
8   Carla   10.0

In [34]:
import numpy as np 

n_linhas, n_colunas = df.shape


lista_faltas = np.random.randint(low=0, high=10, size= n_linhas)
lista_faltas

array([8, 1, 4, 1, 7, 1, 6, 5, 4])

In [38]:
import numpy as np 

n_linhas, n_colunas = df.shape

np.random.seed(42) # semente para gerar sempre os mesmo numeros
lista_faltas = np.random.randint(low=0, high=10, size= n_linhas)
lista_faltas

array([6, 3, 7, 4, 6, 9, 2, 6, 7])

In [39]:
# Atribuindo uma nova coluna no df
df['Faltas'] = lista_faltas
df

   Alunos  Notas  Faltas
0  Sandro    8.0       6
1  Rafael   10.0       3
2   Tiago    9.5       7
3   André    7.5       4
4  Camila    9.5       6
5     Teo   10.0       9
6  Carlos    5.0       2
7    Juca    6.5       6
8   Carla   10.0       7

In [40]:
# Exibindo apenas duas colunas

df[ ['Alunos', 'Faltas'] ]

   Alunos  Faltas
0  Sandro       6
1  Rafael       3
2   Tiago       7
3   André       4
4  Camila       6
5     Teo       9
6  Carlos       2
7    Juca       6
8   Carla       7

In [42]:
# Filtrar faltas e mostrar alunos e faltas

df[ df['Faltas'] > 6 ][['Alunos', 'Notas']]

  Alunos  Notas
2  Tiago    9.5
5    Teo   10.0
8  Carla   10.0

In [46]:
# Classificar se falta mto ou pouco

def classe_faltas(valor):
    if valor >= 5:
        classificacao = 'muito'
    else:
        classificacao = 'pouco'
        
    return classificacao

In [48]:
df['Faltas'].apply(classe_faltas)
#df

0    muito
1    pouco
2    muito
3    pouco
4    muito
5    muito
6    pouco
7    muito
8    muito
Name: Faltas, dtype: object

In [50]:
df['classe_faltas'] = df['Faltas'].apply(classe_faltas)
df

   Alunos  Notas  Faltas classe_faltas
0  Sandro    8.0       6         muito
1  Rafael   10.0       3         pouco
2   Tiago    9.5       7         muito
3   André    7.5       4         pouco
4  Camila    9.5       6         muito
5     Teo   10.0       9         muito
6  Carlos    5.0       2         pouco
7    Juca    6.5       6         muito
8   Carla   10.0       7         muito

In [58]:
df['classe_faltas'].value_counts(normalize=True).mul(100)

classe_faltas
muito    66.666667
pouco    33.333333
Name: proportion, dtype: float64

In [61]:
classe_faltas2 = np.where(df['Faltas'] >=5, "muitas", "poucas")
classe_faltas2

array(['muitas', 'poucas', 'muitas', 'poucas', 'muitas', 'muitas',
       'poucas', 'muitas', 'muitas'], dtype='<U6')

In [62]:
df['classe_faltas2'] = classe_faltas2
df

   Alunos  Notas  Faltas classe_faltas classe_faltas2
0  Sandro    8.0       6         muito         muitas
1  Rafael   10.0       3         pouco         poucas
2   Tiago    9.5       7         muito         muitas
3   André    7.5       4         pouco         poucas
4  Camila    9.5       6         muito         muitas
5     Teo   10.0       9         muito         muitas
6  Carlos    5.0       2         pouco         poucas
7    Juca    6.5       6         muito         muitas
8   Carla   10.0       7         muito         muitas

In [64]:
# Media de quem falta mto ou pouco

media_falta_muito = df[ df['classe_faltas']=='muito']['Notas'].mean()
media_falta_pouco = df[ df['classe_faltas']=='pouco']['Notas'].mean()

print(f"{media_falta_muito}\n{media_falta_pouco}")

8.916666666666666
7.5

In [65]:
df.groupby('classe_faltas')['Notas'].mean()

classe_faltas
muito    8.916667
pouco    7.500000
Name: Notas, dtype: float64

In [66]:
df.groupby('classe_faltas')['Notas'].mean().reset_index()

  classe_faltas     Notas
0         muito  8.916667
1         pouco  7.500000

In [67]:
df.groupby('classe_faltas').size()

classe_faltas
muito    6
pouco    3
dtype: int64

In [69]:
df['classe_faltas'].value_counts()

classe_faltas
muito    6
pouco    3
Name: count, dtype: int64

In [71]:
df.groupby('classe_faltas').count()

               Alunos  Notas  Faltas  classe_faltas2
classe_faltas
muito               6      6       6               6
pouco               3      3       3               3

In [73]:
df.groupby('classe_faltas')['Notas'].max()

classe_faltas
muito    10.0
pouco    10.0
Name: Notas, dtype: float64

In [75]:
df.groupby('classe_faltas')['Notas'].std()

classe_faltas
muito    1.393437
pouco    2.500000
Name: Notas, dtype: float64

In [77]:
df.groupby('classe_faltas')['Notas'].sum()

classe_faltas
muito    53.5
pouco    22.5
Name: Notas, dtype: float64

In [78]:
df.groupby('classe_faltas')['Notas'].nlargest(3)

classe_faltas
muito          5    10.0
               8    10.0
               2     9.5
pouco          1    10.0
               3     7.5
               6     5.0
Name: Notas, dtype: float64

In [79]:
df.groupby('classe_faltas')['Notas'].nlargest(3).reset_index()

  classe_faltas  level_1  Notas
0         muito        5   10.0
1         muito        8   10.0
2         muito        2    9.5
3         pouco        1   10.0
4         pouco        3    7.5
5         pouco        6    5.0

INTERVALO

Projeto